Revit 2027 API
ExternalService.IsRegisteredServerId Method
 Checks if the Id represents a valid server that has been registered for the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRegisteredServerId(
	Guid serverId
)
Public Function IsRegisteredServerId (
	serverId As Guid
) As Boolean
public:
bool IsRegisteredServerId(
	Guid serverId
)
member IsRegisteredServerId :
        serverId : Guid -> bool
Parameters
serverId Guid
 An Id of a server
Return Value
Boolean
 True if the specified server is currently registed for this service, false otherwise.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace